<script setup lang="ts">

definePageMeta({
    layout: 'product',
})
</script>

<template>
    <section class="products-section">
        <div class="wrapper_inner ">

                        <h2><br>
                        </h2>
                        <p>
                            Договор публичной оферты является публичным, то есть согласно статье 633 Гражданского
                            кодекса Украины его условия одинаковы для всех покупателей независимо от статуса (физическое
                            лицо, юридическое лицо, физическое лицо - предприниматель). При полном согласии с данным
                            Договором, покупатель принимает условия и порядок оформления заказа, оплаты товара, доставки
                            товара и за невыполнение условий настоящего договора.
                        </p>
                        <p>
                            <br>
                        </p>
                        <p>
                            Этот текст является соглашением между интернет-магазином <a
                                href="https://www.rrococo.com/">www.</a><a
                                href="https://www.rrococo.com/">rrococo.com</a>&nbsp;, именуемым в дальнейшем
                            «интернет-магазин», и любым юридическим или физическим лицом, пользователем услуг
                            интернет-магазина, которая в дальнейшем именуется «Покупатель» и определяет условия
                            приобретение товаров через сайт интернет-магазина.
                        </p>
                        <p>
                            <br>
                        </p>
                        <p>
                            Это соглашение носит характер публичной оферты, является эквивалентом «устного соглашения» и
                            в соответствии с действующим законодательством Украины имеет надлежащую юридическую силу.
                        </p>
                        <p>
                            <br>
                        </p>
                        <h2 class="header-text">
                            Общие положения
                        </h2>
                        <p>
                            Этот договор является публичной офертой (в соответствии со ст.ст. 633, 641 и гл. 63
                            Гражданского кодекса Украины) и содержит все существенные условия организации купли-продажи
                            дистанционным способом, то есть через интернет-магазин.
                        </p>
                        <p>
                            В соответствии со ст. 642 Гражданского Кодекса Украины полным и беспрекословным принятием
                            условий публичного договора, то есть публичной оферты интернет-магазина факт оформления
                            заказа нажатием на ссылку «Оформить заказ» в корзине и оплаты заказа в размере 100% на
                            условиях этого соглашения.
                        </p>
                        <p>
                            Публичная оферта также принятой при регистрации Покупателя на сайте интернет-магазина.
                        </p>
                        <p>
                            Заключая Договор, Покупатель подтверждает, что целиком и полностью ознакомлен и согласен с
                            его условиями, а также в случае, если Покупатель является физическим лицом, дает разрешение
                            на обработку своих персональных данных с целью возможности выполнения условий настоящего
                            Договора, возможности проведения взаиморасчетов, а также для получения счетов, актов и
                            других документов. Разрешение на обработку персональных данных действует в течение всего
                            срока действия Договора. Кроме этого, заключением настоящего Договора, Покупатель
                            подтверждает, что ему сообщено (без дополнительного уведомления) о правах, установленные
                            Законом Украины «О защите персональных данных», о целях сбора данных. Объем прав Покупателя,
                            как субъекта персональных данных в соответствии с Законом Украины «О защите персональных
                            данных», ему известен и понятен.
                        </p>
                        <p>
                            Термины и определения
                        </p>
                        <p>
                            «Товар» - перечень наименований ассортимента, представленный в интернет-магазине.
                        </p>
                        <p>
                            «Категории» - информация о товарах, размещенная в интернет-магазине.
                        </p>
                        <p>
                            «Оформить заказ» - решение Покупателя приобрести товар, оформленное в интернет-магазине.
                        </p>
                        <p>
                            «Персональные данные» - любая информация, которая прямо или косвенно относится к
                            определенному лицу, или к лицу, определяется.
                        </p>
                        <h2 class="header-text">
                            ПРЕДМЕТ ДОГОВОРА
                        </h2>
                        <p>
                            Интернет-магазин обязуется передать в собственность Покупателю товар, а Покупатель обязуется
                            оплатить и принять товар на условиях Настоящего договора.
                        </p>
                        <p>
                            Этот договор регулирует куплю-продажу в интернет-магазине, в том числе:
                        </p>
                        <p>
                            а) добровольный выбор Покупателем товаров по «Категориям»;
                        </p>
                        <p>
                            б) самостоятельное оформление Покупателем заказа в интернет-магазине;
                        </p>
                        <p>
                            в) оплата Покупателем заказа, оформленного в интернет-магазине;
                        </p>
                        <p>
                            г) выполнение и передача заказа Покупателю в собственность на условиях Настоящего договора.
                        </p>
                        <h2 class="header-text">
                            ПОРЯДОК ОФОРМЛЕНИЯ ЗАКАЗА
                        </h2>
                        <p>
                            Покупатель самостоятельно оформляет заказ в интернет-магазине.
                        </p>
                        <h2 class="header-text">
                            СТОИМОСТЬ И ПОРЯДОК ОПЛАТЫ ЗАКАЗ
                        </h2>
                        <p>
                            Полная стоимость заказа состоит из стоимости товара (указанной в каталоге) и стоимости
                            доставки.
                        </p>
                        <p>
                            Покупатель оплачивает заказ любым способом, выбранным в интернет-магазине в течение 2-х
                            рабочих дней, считая со дня согласования стоимости и ассортимента товаров.
                        </p>
                        <p>
                            Стоимость доставки заказа оплачивается Покупателем самостоятельно при получении заказа.
                        </p>
                        <h2 class="header-text">
                            ДОСТАВКА ЗАКАЗА
                        </h2>
                        <p>
                            Общий срок доставки товара состоит из срока обработки заказа и срока доставки. Срок
                            обработки заказа - от одного рабочего дня до трех. Способы доставки подробно описаны в
                            разделе сайта «Оплата и доставка». Срок доставки Новой почтой от 1 до 3 суток, в зависимости
                            от адреса населенного пункта.
                        </p>
                        <p>
                            При заказе оптовых партий, сроки и методы доставки согласовываются отдельно в каждом
                            конкретном случае.
                        </p>
                        <p>
                            Продавец не несет ответственности за срок доставки заказа, так как они зависят от действий
                            третьих лиц (перевозчиков).
                        </p>
                        <h2 class="header-text">
                            ПРАВА И ОБЯЗАННОСТИ СТОРОН
                        </h2>
                        <p>
                            Покупатель обязан:
                        </p>
                        <p>
                            а) самостоятельно оформить заказ в интернет-магазинах;
                        </p>
                        <p>
                            б) своевременно оплатить и получить заказ в Перевозчика на условиях настоящего договора.
                        </p>
                        <p>
                            Покупатель имеет право требовать от интернет-магазина соблюдения условий настоящего
                            договора.
                        </p>
                        <p>
                            Интернет - магазин обязан:
                        </p>
                        <p>
                            а) соблюдать условия этого договора;
                        </p>
                        <p>
                            б) передать Покупателю товар в соответствии с выбранным образцом по «Каталогу», оформленным
                            заказом и условиями настоящего договора;
                        </p>
                        <p>
                            в) интернет-магазин не несет ответственности, не может выступать в качестве ответчика в суде
                            и не возмещает убытки, возникшие у Покупателя из-за действия или бездействие третьих лиц.
                        </p>
                        <p>
                            Срока действия настоящего договора
                        </p>
                        <p>
                            Настоящий договор вступает в силу со дня оформления заказа и действует до выполнения всех
                            условий договора.
                        </p>
                    </div>
    </section>
</template>

<style scoped>
.products-section {
    margin: 50px 0px;
}

.wrapper_inner {
    max-width: 1350px;
    padding: 0px 30px;
    margin: 0 auto;
    background: #fff;
    float: none;
}

.header-text {
    font-size: large;
    font-weight: bold;
    margin: 20px 0;
}

p {
    margin: 10px 0;
}
</style>